---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem
source: html/5fb04b00-61d7-d8d6-cf12-e30ad04ea3e7.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem

A flow path of the pipe/pipe fitting and accessory. It is defined by the begin connector and end connector

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryPressureDropItem : IDisposable
```